combined/BEEGFS-all-k8s-node/fio-k8s-write-buffered-block_512k-size_2G-threads_1.log
fio-beegfs-write-buffered-block_512k-size_2G-threads_1: (g=0): rw=rw, bs=512K-512K/512K-512K/512K-512K, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-write-buffered-block_512k-size_2G-threads_1: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-write-buffered-block_512k-size_2G-threads_1: (groupid=0, jobs=1): err= 0: pid=2789: Sun Nov 18 21:36:00 2018
  write: io=115662MB, bw=493489KB/s, iops=963, runt=240001msec
    clat (usec): min=415, max=762284, avg=1027.71, stdev=14370.77
     lat (usec): min=419, max=762292, avg=1035.46, stdev=14370.77
    clat percentiles (usec):
     |  1.00th=[  446],  5.00th=[  470], 10.00th=[  490], 20.00th=[  524],
     | 30.00th=[  540], 40.00th=[  548], 50.00th=[  556], 60.00th=[  564],
     | 70.00th=[  572], 80.00th=[  580], 90.00th=[  604], 95.00th=[  620],
     | 99.00th=[  668], 99.50th=[  700], 99.90th=[228352], 99.95th=[452608],
     | 99.99th=[528384]
    bw (KB  /s): min= 2965, max=947200, per=100.00%, avg=520849.48, stdev=389888.19
    lat (usec) : 500=12.49%, 750=87.22%, 1000=0.06%
    lat (msec) : 2=0.04%, 4=0.02%, 10=0.02%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.01%, 250=0.02%, 500=0.08%, 750=0.02%, 1000=0.01%
  cpu          : usr=1.10%, sys=15.20%, ctx=1060915, majf=0, minf=4935
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=231324/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=115662MB, aggrb=493489KB/s, minb=493489KB/s, maxb=493489KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 97.43%
  unit work: mean=54.83us, stddev=2.75