combined/BEEGFS-all-k8s-node/fio-k8s-write-unbuffered-block_16k-size_1G-threads_1.log
fio-beegfs-write-unbuffered-block_16k-size_1G-threads_1: (g=0): rw=rw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-write-unbuffered-block_16k-size_1G-threads_1: Laying out IO file(s) (4 file(s) / 4096MB)

fio-beegfs-write-unbuffered-block_16k-size_1G-threads_1: (groupid=0, jobs=1): err= 0: pid=611: Fri Nov 23 07:17:21 2018
  write: io=18737MB, bw=79945KB/s, iops=4996, runt=240001msec
    clat (usec): min=139, max=32004, avg=198.11, stdev=92.67
     lat (usec): min=139, max=32004, avg=198.44, stdev=92.68
    clat percentiles (usec):
     |  1.00th=[  155],  5.00th=[  163], 10.00th=[  167], 20.00th=[  171],
     | 30.00th=[  177], 40.00th=[  187], 50.00th=[  193], 60.00th=[  199],
     | 70.00th=[  207], 80.00th=[  219], 90.00th=[  235], 95.00th=[  258],
     | 99.00th=[  298], 99.50th=[  314], 99.90th=[  370], 99.95th=[  494],
     | 99.99th=[ 2040]
    bw (KB  /s): min=63456, max=89024, per=100.00%, avg=79967.16, stdev=3651.22
    lat (usec) : 250=93.47%, 500=6.48%, 750=0.02%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.83%, sys=17.14%, ctx=2398375, majf=0, minf=19349
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1199173/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=18737MB, aggrb=79944KB/s, minb=79944KB/s, maxb=79944KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 99.59%
  unit work: mean=56.05us, stddev=2.50