combined/BEEGFS-all-k8s-node/fio-k8s-write-unbuffered-block_16k-size_2G-threads_2.log
fio-beegfs-write-unbuffered-block_16k-size_2G-threads_2: (g=0): rw=rw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 2 processes
fio-beegfs-write-unbuffered-block_16k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)
fio-beegfs-write-unbuffered-block_16k-size_2G-threads_2: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-write-unbuffered-block_16k-size_2G-threads_2: (groupid=0, jobs=2): err= 0: pid=6175: Fri Nov 23 13:16:27 2018
  write: io=34535MB, bw=147347KB/s, iops=9209, runt=240001msec
    clat (usec): min=142, max=26536, avg=215.27, stdev=61.31
     lat (usec): min=143, max=26537, avg=215.55, stdev=61.31
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  171], 10.00th=[  177], 20.00th=[  185],
     | 30.00th=[  193], 40.00th=[  201], 50.00th=[  209], 60.00th=[  217],
     | 70.00th=[  227], 80.00th=[  241], 90.00th=[  262], 95.00th=[  286],
     | 99.00th=[  334], 99.50th=[  354], 99.90th=[  418], 99.95th=[  524],
     | 99.99th=[ 2928]
    bw (KB  /s): min=67360, max=80000, per=50.01%, avg=73694.37, stdev=1954.41
    lat (usec) : 250=84.68%, 500=15.27%, 750=0.03%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=1.62%, sys=16.36%, ctx=4420363, majf=0, minf=36488
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2210216/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=34535MB, aggrb=147347KB/s, minb=147347KB/s, maxb=147347KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 96.53%
  unit work: mean=54.51us, stddev=2.61