combined/BEEGFS-all-k8s-node/fio-k8s-write-unbuffered-block_16k-size_4G-threads_8.log
fio-beegfs-write-unbuffered-block_16k-size_4G-threads_8: (g=0): rw=rw, bs=16K-16K/16K-16K/16K-16K, ioengine=psync, iodepth=1
...
fio-2.2.10
Starting 8 processes
fio-beegfs-write-unbuffered-block_16k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-unbuffered-block_16k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
fio-beegfs-write-unbuffered-block_16k-size_4G-threads_8: Laying out IO file(s) (4 file(s) / 16384MB)
[...]

fio-beegfs-write-unbuffered-block_16k-size_4G-threads_8: (groupid=0, jobs=8): err= 0: pid=16150: Sat Nov 24 15:47:10 2018
  write: io=86766MB, bw=370177KB/s, iops=23136, runt=240017msec
    clat (usec): min=151, max=43433, avg=343.72, stdev=204.77
     lat (usec): min=151, max=43433, avg=344.08, stdev=204.82
    clat percentiles (usec):
     |  1.00th=[  262],  5.00th=[  278], 10.00th=[  290], 20.00th=[  302],
     | 30.00th=[  310], 40.00th=[  314], 50.00th=[  318], 60.00th=[  326],
     | 70.00th=[  338], 80.00th=[  354], 90.00th=[  386], 95.00th=[  454],
     | 99.00th=[  764], 99.50th=[  852], 99.90th=[ 1912], 99.95th=[ 5408],
     | 99.99th=[ 7584]
    bw (KB  /s): min=38080, max=49248, per=12.51%, avg=46291.81, stdev=1661.53
    lat (usec) : 250=0.37%, 500=95.87%, 750=2.68%, 1000=0.85%
    lat (msec) : 2=0.13%, 4=0.03%, 10=0.06%, 20=0.01%, 50=0.01%
  cpu          : usr=1.03%, sys=10.96%, ctx=11108701, majf=0, minf=107419
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=5553045/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=86766MB, aggrb=370176KB/s, minb=370176KB/s, maxb=370176KB/s, mint=240017msec, maxt=240017msec

CPU idleness:
  system: 90.07%
  unit work: mean=51.60us, stddev=2.14