combined/BEEGFS-all-k8s-node/fio-k8s-write-unbuffered-block_64k-size_2G-threads_1.log
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_1: (g=0): rw=rw, bs=64K-64K/64K-64K/64K-64K, ioengine=psync, iodepth=1
fio-2.2.10
Starting 1 process
fio-beegfs-write-unbuffered-block_64k-size_2G-threads_1: Laying out IO file(s) (4 file(s) / 8192MB)

fio-beegfs-write-unbuffered-block_64k-size_2G-threads_1: (groupid=0, jobs=1): err= 0: pid=2275: Fri Nov 23 08:41:02 2018
  write: io=44245MB, bw=188778KB/s, iops=2949, runt=240001msec
    clat (usec): min=262, max=35145, avg=336.22, stdev=174.66
     lat (usec): min=262, max=35146, avg=337.17, stdev=174.67
    clat percentiles (usec):
     |  1.00th=[  274],  5.00th=[  286], 10.00th=[  298], 20.00th=[  306],
     | 30.00th=[  314], 40.00th=[  322], 50.00th=[  326], 60.00th=[  338],
     | 70.00th=[  346], 80.00th=[  354], 90.00th=[  374], 95.00th=[  398],
     | 99.00th=[  450], 99.50th=[  474], 99.90th=[  732], 99.95th=[ 2928],
     | 99.99th=[ 8640]
    bw (KB  /s): min=145792, max=213888, per=100.00%, avg=188847.02, stdev=8188.36
    lat (usec) : 500=99.75%, 750=0.15%, 1000=0.02%
    lat (msec) : 2=0.02%, 4=0.02%, 10=0.03%, 20=0.01%, 50=0.01%
  cpu          : usr=1.43%, sys=13.29%, ctx=2037230, majf=0, minf=13590
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=707922/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=44245MB, aggrb=188778KB/s, minb=188778KB/s, maxb=188778KB/s, mint=240001msec, maxt=240001msec

CPU idleness:
  system: 87.86%
  unit work: mean=49.42us, stddev=2.99